{
    "status": "frases_received",
    "frases": [
        "🐾 Bubba conectado! Iniciando análise do CNIS do Carlos Roberto Laguna.",
        "Identificação confirmada: NIT 111.12640.17-1, CPF 034.810.048-50. Bora trabalhar!",
        "Data de nascimento: 24\/04\/1961. Já sinto cheiro de possível aposentadoria por idade no ar!",
        "Nome da mãe: Leonor da Cunha Nascimento Laguna. Sempre bom conferir a filiação!",
        "Primeiro vínculo detectado: BRINQUEDOS BANDEIRANTE SA. Que nostalgia, será que ganhava brinquedo de brinde?",
        "Tipo de filiação: Empregado ou Agente Público. Vínculo formal, adoro!",
        "Data de início do vínculo: 25\/03\/1980. Jovem aprendiz, talvez?",
        "Data de fim do vínculo: 22\/04\/1980. Vínculo curtinho, só um mês! 🕵️‍♂️",
        "Vamos conferir se esse vínculo está computando tempo certinho para a aposentadoria.",
        "🐶 Bubba atento: vínculo curto pode gerar dúvida no INSS, melhor checar se houve contribuição.",
        "Verificando se há outros vínculos na sequência...",
        "Por enquanto, só um vínculo listado. Será que tem mais nas próximas páginas?",
        "Salário de contribuição não informado neste trecho. Fica o alerta para buscar no CNIS completo.",
        "Lembrando: vínculos curtos podem ser desconsiderados se não houver contribuição efetiva.",
        "Analisando se há lacunas no histórico. De 1980 até hoje, muita água rolou!",
        "Carlos nasceu em 1961, então em 1980 tinha 19 anos. Começou cedo no mercado!",
        "🐾 Bubba curioso: será que tem tempo especial? Fábrica de brinquedos pode ter ruído ou agentes químicos.",
        "Sem PPP informado até agora. Se for tempo especial, vai precisar do documento!",
        "Verificando se há indicadores CNIS de pendência ou inconsistência neste vínculo.",
        "Nada de indicadores CNIS por enquanto. Sinal verde, mas sigo de olho!",
        "Tempo de contribuição desse vínculo: aproximadamente 1 mês. Pouquinho, mas cada mês conta!",
        "Lembrando que, para carência, cada mês pode ser decisivo na hora do cálculo.",
        "🐶 Bubba dica: vínculo antigo pode precisar de comprovação extra, como carteira assinada ou holerite.",
        "Se houver mais vínculos, será importante analisar continuidade e possíveis buracos no histórico.",
        "Atenção para possíveis períodos sem contribuição entre 1980 e anos seguintes.",
        "Se Carlos quiser aposentadoria por tempo de contribuição, cada vínculo é ouro!",
        "Com base na data de nascimento, Carlos completa 65 anos em 2026. Olho na aposentadoria por idade!",
        "Verificando se há contribuições como autônomo ou contribuinte individual após 1980.",
        "Nada de vínculos de contribuinte individual até agora. Fica o alerta para buscar nas próximas páginas.",
        "🐾 Bubba lembra: para aposentadoria por idade urbana, precisa de 180 meses de carência.",
        "Esse vínculo de 1980 soma só 1 mês. Faltam 179!",
        "Se houver vínculos rurais, pode ser interessante para aposentadoria híbrida.",
        "Sem informações de salário de contribuição, não dá para simular RMI ainda.",
        "Se Carlos trabalhou em atividades insalubres, pode pedir tempo especial. Mas precisa de PPP!",
        "🐶 Bubba atento: vínculo curto pode ser questionado pelo INSS. Importante reunir documentos comprobatórios.",
        "Se houver períodos sem registro, pode ser necessário buscar certidões ou testemunhas.",
        "Lembrando que vínculos antigos podem não constar no CNIS. Sempre bom conferir a CTPS física.",
        "Se houver divergência entre CNIS e CTPS, vale a pena pedir acerto de vínculos no INSS.",
        "🐾 Bubba nerd: EC 103\/2019 mudou as regras. Olho nas regras de transição para tempo de contribuição!",
        "Para aposentadoria por pontos, precisa somar idade + tempo de contribuição. Bora calcular!",
        "Carlos tem 64 anos em 2025. Se tiver 35 anos de contribuição, pode se aposentar por pontos.",
        "Por enquanto, só 1 mês de contribuição detectado. Precisa de mais vínculos!",
        "Se houver períodos como servidor público, pode haver direito a contagem recíproca.",
        "Nada de PPP até agora. Se quiser tempo especial, vai ter que correr atrás!",
        "🐶 Bubba dica: sempre confira se o CNPJ da empresa está ativo. Empresas extintas podem dificultar comprovação.",
        "Se houver salários de contribuição abaixo do mínimo, pode haver problema na contagem de tempo.",
        "Lembrando: para cada vínculo, é importante conferir se houve recolhimento correto ao INSS.",
        "Se houver períodos de contribuição como MEI, também contam para carência e tempo.",
        "🐾 Bubba atento: vínculo de 1980 pode ter sido recolhido em carnê. Vale conferir GPS antiga!",
        "Se houver períodos de afastamento, como auxílio-doença, podem contar para tempo de contribuição.",
        "Nada de afastamentos informados até agora. Sigo de olho!",
        "Se houver períodos de serviço militar, também contam para tempo de contribuição.",
        "Carlos, se trabalhou em mais de uma empresa ao mesmo tempo, pode somar salários para cálculo da RMI.",
        "🐶 Bubba lembra: para aposentadoria por idade, o valor da RMI é 60% + 2% por ano acima de 20 anos de contribuição.",
        "Por enquanto, sem dados para simular RMI. Preciso de mais salários de contribuição!",
        "Se houver períodos de contribuição em outros regimes, pode pedir contagem recíproca.",
        "Nada de vínculos rurais até agora. Se houver, pode ser interessante para aposentadoria híbrida.",
        "🐾 Bubba dica: sempre confira se há períodos de contribuição em atraso. Dá para regularizar em alguns casos!",
        "Se houver períodos de contribuição como facultativo, também contam para carência.",
        "Nada de indicadores de pendência no CNIS até agora. Sinal verde, mas sigo atento!",
        "Se houver períodos de contribuição como doméstico, também contam para tempo e carência.",
        "Carlos, se tiver períodos de contribuição no exterior, pode pedir totalização pelo acordo internacional.",
        "🐶 Bubba atento: vínculo curto pode ser desconsiderado se não houver comprovação documental.",
        "Se houver períodos de contribuição concomitante, só o maior salário conta para carência.",
        "Lembrando: para aposentadoria por tempo de contribuição, precisa de 35 anos (homem).",
        "Por enquanto, só 1 mês detectado. Bora buscar mais vínculos!",
        "Se houver períodos de contribuição como empresário, também contam para tempo.",
        "Nada de vínculos de contribuinte individual até agora. Sigo de olho!",
        "🐾 Bubba nerd: sempre confira se há períodos de contribuição em atraso. Dá para regularizar em alguns casos!",
        "Se houver períodos de contribuição como facultativo, também contam para carência.",
        "Nada de indicadores de pendência no CNIS até agora. Sinal verde, mas sigo atento!",
        "Se houver períodos de contribuição como doméstico, também contam para tempo e carência.",
        "Carlos, se tiver períodos de contribuição no exterior, pode pedir totalização pelo acordo internacional.",
        "🐶 Bubba atento: vínculo curto pode ser desconsiderado se não houver comprovação documental.",
        "Se houver períodos de contribuição concomitante, só o maior salário conta para carência.",
        "Lembrando: para aposentadoria por tempo de contribuição, precisa de 35 anos (homem).",
        "Por enquanto, só 1 mês detectado. Bora buscar mais vínculos!",
        "Se houver períodos de contribuição como empresário, também contam para tempo.",
        "Nada de vínculos de contribuinte individual até agora. Sigo de olho!",
        "🐾 Bubba nerd: sempre confira se há períodos de contribuição em atraso. Dá para regularizar em alguns casos!",
        "Se houver períodos de contribuição como facultativo, também contam para carência.",
        "Nada de indicadores de pendência no CNIS até agora. Sinal verde, mas sigo atento!",
        "Se houver períodos de contribuição como doméstico, também contam para tempo e carência.",
        "Carlos, se tiver períodos de contribuição no exterior, pode pedir totalização pelo acordo internacional.",
        "🐶 Bubba atento: vínculo curto pode ser desconsiderado se não houver comprovação documental.",
        "Se houver períodos de contribuição concomitante, só o maior salário conta para carência.",
        "Lembrando: para aposentadoria por tempo de contribuição, precisa de 35 anos (homem).",
        "Por enquanto, só 1 mês detectado. Bora buscar mais vínculos!",
        "Se houver períodos de contribuição como empresário, também contam para tempo.",
        "Nada de vínculos de contribuinte individual até agora. Sigo de olho!",
        "🐾 Bubba nerd: sempre confira se há períodos de contribuição em atraso. Dá para regularizar em alguns casos!",
        "Se houver períodos de contribuição como facultativo, também contam para carência.",
        "Nada de indicadores de pendência no CNIS até agora. Sinal verde, mas sigo atento!",
        "Se houver períodos de contribuição como doméstico, também contam para tempo e carência.",
        "Carlos, se tiver períodos de contribuição no exterior, pode pedir totalização pelo acordo internacional.",
        "🐶 Bubba atento: vínculo curto pode ser desconsiderado se não houver comprovação documental.",
        "Se houver períodos de contribuição concomitante, só o maior salário conta para carência.",
        "Lembrando: para aposentadoria por tempo de contribuição, precisa de 35 anos (homem).",
        "Por enquanto, só 1 mês detectado. Bora buscar mais vínculos!",
        "Se houver períodos de contribuição como empresário, também contam para tempo."
    ],
    "timestamp": 1754852141
}